docs/spec/html/concepts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 17:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Masahiro Ishida" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org903e6ef">1. 0. Document Contract</a>
<ul>
<li><a href="#orgb4e8d57">1.1. 目的</a></li>
<li><a href="#orgebf75b4">1.2. 対象</a></li>
<li><a href="#org0cb3415">1.3. 非目的（明示的にやらないこと）</a></li>
</ul>
</li>
<li><a href="#orga47a81c">2. 1. 背景と課題</a></li>
<li><a href="#org676d8d2">3. 2. 設計思想（Principles）</a>
<ul>
<li><a href="#orgf38d083">3.1. 2.1 重要度で並べない／順位付けしない</a></li>
<li><a href="#orga4298ea">3.2. 2.2 情報は「価値」ではなく「扱い方」で分ける</a></li>
<li><a href="#org4fbd8c4">3.3. 2.3 人は入れるだけ、AI は減らすだけ</a></li>
<li><a href="#org5a7c11e">3.4. 2.4 判断を急がないために「状態」を導入する</a></li>
<li><a href="#orgd55e268">3.5. 2.5 完全不可視は忘却を招くため、存在だけを匂わせる</a></li>
<li><a href="#org2c5143f">3.6. 2.6 ナレッジは「書く」だけでなく「選ぶ」ことで生まれる</a></li>
<li><a href="#org3a3a4b4">3.7. 2.7 重複回避の責任を人からシステムへ移す</a></li>
</ul>
</li>
<li><a href="#org3a86946">4. 3. 用語定義（Terminology）</a>
<ul>
<li><a href="#org761b86e">4.1. Content</a></li>
<li><a href="#org969fd32">4.2. Capture</a></li>
<li><a href="#org688371e">4.3. State（状態）</a></li>
<li><a href="#org9d35ac0">4.4. S1: 未確定（Inbox）</a></li>
<li><a href="#orgf5a887f">4.5. S2: 意味づけ済み・非行動（不可視）</a></li>
<li><a href="#orgc19b571">4.6. Topic</a></li>
<li><a href="#org74ed228">4.7. Shelf（棚）</a></li>
<li><a href="#orga0d9c5a">4.8. Focus Topic</a></li>
<li><a href="#org2569677">4.9. Knowledge</a></li>
<li><a href="#orgc67c233">4.10. Task</a></li>
<li><a href="#org7c8aeca">4.11. 意図ラベル（Intent Label）</a></li>
<li><a href="#orgee750a9">4.12. 想起（Recall）</a></li>
<li><a href="#org84e5fab">4.13. 限定可視（Scoped Reveal）</a></li>
<li><a href="#org2017db7">4.14. TTL（Time To Live）</a></li>
<li><a href="#orgbc8d423">4.15. 消化（Digest）</a></li>
</ul>
</li>
<li><a href="#org62184bd">5. 4. 状態モデル（State Model）</a>
<ul>
<li><a href="#orgd6f9d03">5.1. 4.1 状態一覧</a></li>
<li><a href="#org77c008f">5.2. 4.2 各状態の性質</a>
<ul>
<li><a href="#orgd9f95b8">5.2.1. S1: 未確定（Inbox）</a></li>
<li><a href="#org8832876">5.2.2. S2: 意味づけ済み・非行動（不可視）</a></li>
<li><a href="#orgbc65e86">5.2.3. S3: Focus Topic</a></li>
<li><a href="#org6da17fb">5.2.4. S4: Knowledge</a></li>
<li><a href="#org3117f77">5.2.5. S6: Drop</a></li>
<li><a href="#org88e85ef">5.2.6. S7: Trash</a></li>
</ul>
</li>
<li><a href="#org5087336">5.3. 4.3 状態遷移ルール（if 文レベル）</a>
<ul>
<li><a href="#org5ef5552">5.3.1. S0 → S1（Capture → 未確定）</a></li>
<li><a href="#org1bfb005">5.3.2. S1 → S2（未確定 → 意味づけ済み）</a></li>
<li><a href="#org75bcb17">5.3.3. S1 → S7（未確定 → Trash）</a></li>
<li><a href="#org6ffd90e">5.3.4. S2 → S7（意味づけ済み → Trash）</a></li>
<li><a href="#org603dd59">5.3.5. S2 → S3（意味づけ済み → Focus Topic）</a></li>
<li><a href="#org65e8598">5.3.6. S2 → S5（意味づけ済み → Task）</a></li>
<li><a href="#org4dbfaef">5.3.7. S3 → S4（Focus Topic → Knowledge）</a></li>
<li><a href="#org6f3b48d">5.3.8. S3 → S6（Focus Topic → Drop）</a></li>
<li><a href="#orgebdfc0c">5.3.9. S4 → S6（Knowledge → Drop）</a></li>
</ul>
</li>
<li><a href="#org11ff92d">5.4. 4.4 重要な補足ルール</a></li>
</ul>
</li>
<li><a href="#orgaf201c8">6. 5. 可視性設計（Visibility）</a>
<ul>
<li><a href="#orgf85f331">6.1. 5.1 可視性の原則</a></li>
<li><a href="#org51850f1">6.2. 5.2 観測窓（Observation Window）</a></li>
<li><a href="#org3c2abd6">6.3. 5.3 限定可視（Scoped Reveal）</a></li>
</ul>
</li>
<li><a href="#orgc2fb61f">7. 6. 想起トリガー（Recall）</a>
<ul>
<li><a href="#org2b73fa4">7.1. 6.1 想起の原則</a></li>
<li><a href="#orge4f31f0">7.2. 6.2 想起トリガーの種類</a></li>
<li><a href="#org146f2a8">7.3. 6.3 想起頻度</a></li>
</ul>
</li>
<li><a href="#org1203abd">8. 7. AI の責務と禁止事項</a>
<ul>
<li><a href="#orgef7585e">8.1. 7.1 AI が行うこと</a></li>
<li><a href="#orgc0993e6">8.2. 7.2 AI が行わないこと（禁止事項）</a></li>
<li><a href="#org8660a83">8.3. 7.3 テスト条件（設計拘束）</a></li>
</ul>
</li>
<li><a href="#orgd0d66f9">9. 8. MVP 運用フロー</a></li>
<li><a href="#orge94cf39">10. 9. 「消化」の定義</a></li>
<li><a href="#org17a9356">11. 10. データ最小要件</a></li>
<li><a href="#org5d6fc1e">12. 11. ガードレール</a></li>
<li><a href="#orgb693fa5">13. 12. 将来拡張の差し込み口</a></li>
</ul>
</div>
</div>
<div id="outline-container-org903e6ef" class="outline-2">
<h2 id="org903e6ef"><span class="section-number-2">1.</span> 0. Document Contract</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb4e8d57" class="outline-3">
<h3 id="orgb4e8d57"><span class="section-number-3">1.1.</span> 目的</h3>
<div class="outline-text-3" id="text-1-1">
<p>
本ドキュメントは、
</p>

<p>
大量の未評価情報（主に AI / IT 領域）を対象に、
<b><b>重要度や価値の判断を即座に行わず、判断を遅延させたまま安全に保持し、認知負荷と忘却リスクを同時に最小化する個人用コンテンツ・ステージングシステム（content-stager）</b></b>
の設計仕様を定義する。
</p>

<p>
本システムは、情報を「評価する」「選別する」ことを目的とせず、
<b><b>人が判断すべき瞬間まで情報を適切な状態で待機させる</b></b>
ことを主目的とする。
</p>
</div>
</div>
<div id="outline-container-orgebf75b4" class="outline-3">
<h3 id="orgebf75b4"><span class="section-number-3">1.2.</span> 対象</h3>
<div class="outline-text-3" id="text-1-2">
<p>
本システムが扱う情報は以下を含む。
</p>

<ul class="org-ul">
<li>外部情報
<ul class="org-ul">
<li>X（旧 Twitter）の投稿</li>
<li>ブログ記事・技術記事</li>
<li>リンク・スクラップ</li>
</ul></li>
<li>内部情報
<ul class="org-ul">
<li>自分の走り書きメモ</li>
<li>思考途中の断片</li>
<li>未整理のアイデア</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0cb3415" class="outline-3">
<h3 id="org0cb3415"><span class="section-number-3">1.3.</span> 非目的（明示的にやらないこと）</h3>
<div class="outline-text-3" id="text-1-3">
<p>
本システムは、以下を目的としない。
</p>

<ul class="org-ul">
<li>情報の重要度・優先度・価値の自動評価</li>
<li>ランキングやスコアリングによる最適化</li>
<li>完読率・消化率の最大化</li>
<li>レコメンドエンジンの構築</li>
<li>タスク管理システムの完全代替</li>
</ul>

<p>
本システムは「判断を減らす」ための仕組みであり、「より良い判断を自動で行う」ための仕組みではない。
</p>
</div>
</div>
</div>
<div id="outline-container-orga47a81c" class="outline-2">
<h2 id="orga47a81c"><span class="section-number-2">2.</span> 1. 背景と課題</h2>
<div class="outline-text-2" id="text-2">
<p>
AI / IT 領域の情報は、以下の性質を持つ。
</p>

<ul class="org-ul">
<li>入力量が多く、入力時点での重要度判断が破綻しやすい</li>
<li>情報の価値が時間と文脈によって大きく変動する</li>
<li>当初は無価値に見えた情報が、後から効くことがある</li>
<li>一方で、多くの情報は判断する価値すらなく消えてよい</li>
</ul>

<p>
従来の情報管理やタスク管理では、
</p>

<ul class="org-ul">
<li>入力時に重要度や優先度を決めることが前提となり</li>
<li>判断コストが入力のたびに発生し</li>
<li>「すべてを把握・処理しなければならない」という心理的負債が蓄積する</li>
</ul>

<p>
その結果として、
</p>

<ul class="org-ul">
<li>判断疲れが起きる</li>
<li>情報の取り込み自体が滞る</li>
<li>忘却を恐れて溜め込みが発生する</li>
<li>最終的にシステム自体が使われなくなる</li>
</ul>

<p>
本設計は、この構造的な破綻を前提条件として扱い、
**判断を前倒ししない情報管理の形**を設計対象とする。
</p>
</div>
</div>
<div id="outline-container-org676d8d2" class="outline-2">
<h2 id="org676d8d2"><span class="section-number-2">3.</span> 2. 設計思想（Principles）</h2>
<div class="outline-text-2" id="text-3">
<p>
本システムは、以下の原則に基づいて設計される。
</p>
</div>
<div id="outline-container-orgf38d083" class="outline-3">
<h3 id="orgf38d083"><span class="section-number-3">3.1.</span> 2.1 重要度で並べない／順位付けしない</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>情報を重要度・価値・優先度で並べ替えない</li>
<li>ランキング・スコアリング・優先順位付けを行わない</li>
</ul>

<p>
理由：入力時点では価値関数が未成熟であり、この段階での順位付けは誤った判断を固定化するためである。
</p>
</div>
</div>
<div id="outline-container-orga4298ea" class="outline-3">
<h3 id="orga4298ea"><span class="section-number-3">3.2.</span> 2.2 情報は「価値」ではなく「扱い方」で分ける</h3>
<div class="outline-text-3" id="text-3-2">
<p>
情報は次の問いによって分岐される。
</p>

<ul class="org-ul">
<li>行動に変換するか</li>
<li>知識として保持するか</li>
<li>今は何もしないか</li>
<li>消えてよいか</li>
</ul>

<p>
価値判断は、これらの分岐の結果としてのみ現れる。
</p>
</div>
</div>
<div id="outline-container-org4fbd8c4" class="outline-3">
<h3 id="org4fbd8c4"><span class="section-number-3">3.3.</span> 2.3 人は入れるだけ、AI は減らすだけ</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>人の役割
<ul class="org-ul">
<li>情報を捕捉する</li>
<li>弱い主観（一次価値判断）を残す</li>
<li>意図が生じたときにだけ判断する</li>
</ul></li>
<li>AI の役割
<ul class="org-ul">
<li>構造化する</li>
<li>重複や破綻を検出する</li>
<li>事実を提示する</li>
</ul></li>
</ul>

<p>
AI は、価値を解釈しない。
</p>
</div>
</div>
<div id="outline-container-org5a7c11e" class="outline-3">
<h3 id="org5a7c11e"><span class="section-number-3">3.4.</span> 2.4 判断を急がないために「状態」を導入する</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>情報は複数の状態を経由する</li>
<li>状態ごとに可視性を明確に分離する</li>
<li>判断は状態遷移の特定ポイントでのみ発生する</li>
</ul>

<p>
これにより、判断が常時要求される状態を作らない。
</p>
</div>
</div>
<div id="outline-container-orgd55e268" class="outline-3">
<h3 id="orgd55e268"><span class="section-number-3">3.5.</span> 2.5 完全不可視は忘却を招くため、存在だけを匂わせる</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>内容は見せない</li>
<li>ただし「存在している」ことは分かる</li>
</ul>

<p>
本設計ではこれを「不可視＋匂わせ」と定義する。
</p>

<p>
判断を強制せず、完全な忘却も防ぐ。
</p>
</div>
</div>
<div id="outline-container-org2c5143f" class="outline-3">
<h3 id="org2c5143f"><span class="section-number-3">3.6.</span> 2.6 ナレッジは「書く」だけでなく「選ぶ」ことで生まれる</h3>
<div class="outline-text-3" id="text-3-6">
<p>
知識は最初から完成している必要はない。
</p>

<ul class="org-ul">
<li>再遭遇する</li>
<li>判断に使用される</li>
<li>他者に説明したくなる</li>
</ul>

<p>
これらを経て、知識は確定する。
</p>

<p>
本システムでは、
</p>

<p>
Topic → Focus Topic → Knowledge
</p>

<p>
という段階的な知識生成ルートを採用する。
</p>
</div>
</div>
<div id="outline-container-org3a3a4b4" class="outline-3">
<h3 id="org3a3a4b4"><span class="section-number-3">3.7.</span> 2.7 重複回避の責任を人からシステムへ移す</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>人は重複を気にせず情報を投入してよい</li>
<li>重複検出と集約はシステム（AI）の責務とする</li>
</ul>

<p>
これにより、入力時の心理コストを最小化し、「入れるかどうか」を判断する必要をなくす。
</p>
</div>
</div>
</div>
<div id="outline-container-org3a86946" class="outline-2">
<h2 id="org3a86946"><span class="section-number-2">4.</span> 3. 用語定義（Terminology）</h2>
<div class="outline-text-2" id="text-4">
<p>
本章では、content-stager において使用される主要な用語を定義する。
</p>

<p>
本システムでは、用語の曖昧さが実装・運用・将来拡張時の誤解を生まないよう、
<b><b>直感的意味よりも設計上の役割を優先して定義する。</b></b>
</p>
</div>
<div id="outline-container-org761b86e" class="outline-3">
<h3 id="org761b86e"><span class="section-number-3">4.1.</span> Content</h3>
<div class="outline-text-3" id="text-4-1">
<p>
本システムに取り込まれる情報単位の総称。
</p>

<ul class="org-ul">
<li>記事、投稿、リンク、メモなど形式は問わない</li>
<li>内容の理解・評価は前提としない</li>
<li>1 つの入力＝1 Content として扱う</li>
</ul>
</div>
</div>
<div id="outline-container-org969fd32" class="outline-3">
<h3 id="org969fd32"><span class="section-number-3">4.2.</span> Capture</h3>
<div class="outline-text-3" id="text-4-2">
<p>
ユーザーが Content をシステムに入力する行為、およびその直後の瞬間状態。
</p>

<ul class="org-ul">
<li>価値判断を行わない</li>
<li>入力ミスの即時修正のみを許可する</li>
</ul>
</div>
</div>
<div id="outline-container-org688371e" class="outline-3">
<h3 id="org688371e"><span class="section-number-3">4.3.</span> State（状態）</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Content がシステム内で置かれている位置づけ。
</p>

<ul class="org-ul">
<li>状態は Content の性質ではなく、
**システム側の扱い方**を表す</li>
<li>状態遷移は、判断を伴う行為として扱う</li>
</ul>
</div>
</div>
<div id="outline-container-org9d35ac0" class="outline-3">
<h3 id="org9d35ac0"><span class="section-number-3">4.4.</span> S1: 未確定（Inbox）</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>判断・整理を一切行っていない状態</li>
<li>専用の一覧ビューを持たない</li>
<li>入口の緩衝層として機能する</li>
</ul>
</div>
</div>
<div id="outline-container-orgf5a887f" class="outline-3">
<h3 id="orgf5a887f"><span class="section-number-3">4.5.</span> S2: 意味づけ済み・非行動（不可視）</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>AI による最小限の構造化が行われた状態</li>
<li>原則として内容は不可視</li>
<li>存在のみが弱く観測可能</li>
</ul>
</div>
</div>
<div id="outline-container-orgc19b571" class="outline-3">
<h3 id="orgc19b571"><span class="section-number-3">4.6.</span> Topic</h3>
<div class="outline-text-3" id="text-4-6">
<p>
AI が Content から抽出する短い論点断片。
</p>

<ul class="org-ul">
<li>評価や結論を含まない</li>
<li>3〜7 個程度を目安とする</li>
<li>状態 1 / 状態 2 の内部データとして保持される</li>
</ul>
</div>
</div>
<div id="outline-container-org74ed228" class="outline-3">
<h3 id="org74ed228"><span class="section-number-3">4.7.</span> Shelf（棚）</h3>
<div class="outline-text-3" id="text-4-7">
<p>
関連する Topic を束ねた論理的な集合。
</p>

<ul class="org-ul">
<li>ユーザーが全体像を把握するための単位</li>
<li>Content や本文を直接表示しない</li>
<li>Topic 数や性質に応じて動的に形成される</li>
</ul>
</div>
</div>
<div id="outline-container-orga0d9c5a" class="outline-3">
<h3 id="orga0d9c5a"><span class="section-number-3">4.8.</span> Focus Topic</h3>
<div class="outline-text-3" id="text-4-8">
<p>
ユーザーが「重要」「判断に使う」「説明したい」と明示した Topic。
</p>

<ul class="org-ul">
<li>Knowledge の候補</li>
<li>判断が前面化した状態</li>
</ul>
</div>
</div>
<div id="outline-container-org2569677" class="outline-3">
<h3 id="org2569677"><span class="section-number-3">4.9.</span> Knowledge</h3>
<div class="outline-text-3" id="text-4-9">
<p>
判断・説明・再利用の責任を引き受けた情報。
</p>

<ul class="org-ul">
<li>完成された文章である必要はない</li>
<li>Focus Topic からのみ昇格する</li>
</ul>
</div>
</div>
