docs/spec/html/concepts.html
<div id="outline-container-orgc67c233" class="outline-3">
<h3 id="orgc67c233"><span class="section-number-3">4.10.</span> Task</h3>
<div class="outline-text-3" id="text-4-10">
<p>
行動として処理することが確定した情報。
</p>

<ul class="org-ul">
<li>本システムの管理対象外</li>
<li>外部タスク管理システムへの出口として扱う</li>
</ul>
</div>
</div>
<div id="outline-container-org7c8aeca" class="outline-3">
<h3 id="org7c8aeca"><span class="section-number-3">4.11.</span> 意図ラベル（Intent Label）</h3>
<div class="outline-text-3" id="text-4-11">
<p>
Topic に対してユーザーが付与する弱い主観的メモ。
</p>

<p>
例：
</p>
<ul class="org-ul">
<li>気になる</li>
<li>近いうち</li>
<li>重要かも</li>

<li>一次価値判断に相当する</li>
<li>状態遷移を直接引き起こさない</li>
</ul>
</div>
</div>
<div id="outline-container-orgee750a9" class="outline-3">
<h3 id="orgee750a9"><span class="section-number-3">4.12.</span> 想起（Recall）</h3>
<div class="outline-text-3" id="text-4-12">
<p>
不可視状態にある Content / Topic の存在を弱く思い出させる仕組み。
</p>

<ul class="org-ul">
<li>行動要求を伴わない</li>
<li>判断を強制しない</li>
<li>状態を変更しない</li>
</ul>
</div>
</div>
<div id="outline-container-org84e5fab" class="outline-3">
<h3 id="org84e5fab"><span class="section-number-3">4.13.</span> 限定可視（Scoped Reveal）</h3>
<div class="outline-text-3" id="text-4-13">
<p>
ユーザーの明示的意図に基づき、状態 2 の内容を一時的に可視化すること。
</p>

<ul class="org-ul">
<li>常設ビューを持たない</li>
<li>セッション単位で閉じる</li>
</ul>
</div>
</div>
<div id="outline-container-org2017db7" class="outline-3">
<h3 id="org2017db7"><span class="section-number-3">4.14.</span> TTL（Time To Live）</h3>
<div class="outline-text-3" id="text-4-14">
<p>
Content が特定の状態に留まってよい最大時間。
</p>

<ul class="org-ul">
<li>価値判断の代替ではない</li>
<li>判断が発生しなかった情報を自然に消滅させるための仕組み</li>
</ul>
</div>
</div>
<div id="outline-container-orgbc8d423" class="outline-3">
<h3 id="orgbc8d423"><span class="section-number-3">4.15.</span> 消化（Digest）</h3>
<div class="outline-text-3" id="text-4-15">
<p>
Content がシステム上の責務を終えること。
</p>

<ul class="org-ul">
<li>理解・完了を意味しない</li>
<li>Task / Knowledge / Drop / Trash のいずれかに到達した状態を指す</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org62184bd" class="outline-2">
<h2 id="org62184bd"><span class="section-number-2">5.</span> 4. 状態モデル（State Model）</h2>
<div class="outline-text-2" id="text-5">
<p>
本章では、content-stager における
**情報が辿る状態（State）と、その遷移条件**を定義する。
</p>

<p>
本システムにおいて「判断」とは、
**状態遷移を引き起こす行為**を指す。判断は常時発生してはならず、ユーザーの明示的意図がある場合にのみ発生する。
</p>
</div>
<div id="outline-container-orgd6f9d03" class="outline-3">
<h3 id="orgd6f9d03"><span class="section-number-3">5.1.</span> 4.1 状態一覧</h3>
<div class="outline-text-3" id="text-5-1">
<p>
本システムは、以下の状態を持つ。
</p>

<ul class="org-ul">
<li>S0: Capture
<ul class="org-ul">
<li>情報が入力された直後の瞬間状態</li>
</ul></li>
<li>S1: 未確定（Inbox）
<ul class="org-ul">
<li>判断・整理を一切行っていない状態</li>
</ul></li>
<li>S2: 意味づけ済み・非行動（不可視）
<ul class="org-ul">
<li>AI により最小限の構造化が行われた滞留層</li>
</ul></li>
<li>S3: Focus Topic
<ul class="org-ul">
<li>ユーザーが「重要」と明示した Topic</li>
</ul></li>
<li>S4: Knowledge
<ul class="org-ul">
<li>知識として確定した状態</li>
</ul></li>
<li>S5: Task
<ul class="org-ul">
<li>行動として外部タスク管理に委譲された状態</li>
</ul></li>
<li>S6: Drop
<ul class="org-ul">
<li>ユーザーにより不要と判断された状態</li>
</ul></li>
<li>S7: Trash
<ul class="org-ul">
<li>TTL 超過などにより消滅待ちとなった状態</li>
</ul></li>
</ul>

<p>
S5（Task）は、本システムの管理対象外であり、外部タスク管理システムへの出口として扱う。
</p>
</div>
</div>
<div id="outline-container-org77c008f" class="outline-3">
<h3 id="org77c008f"><span class="section-number-3">5.2.</span> 4.2 各状態の性質</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgd9f95b8" class="outline-4">
<h4 id="orgd9f95b8"><span class="section-number-4">5.2.1.</span> S1: 未確定（Inbox）</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>目的:
<ul class="org-ul">
<li>判断しない自由を保証する（入口の緩衝層）</li>
</ul></li>
<li>可視性:
<ul class="org-ul">
<li>専用ビュー（一覧/ダッシュボード）を持たない</li>
<li>入力直後の一時的フィードバック（保存確認）と即時修正（undo/取消）のみ提供する</li>
</ul></li>
<li>禁止事項:
<ul class="org-ul">
<li>重要度評価</li>
<li>整理・分類の強制</li>
</ul></li>
<li>備考:
<ul class="org-ul">
<li>デフォルト TTL を持つ（価値判断ではなく自然忘却のため）</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8832876" class="outline-4">
<h4 id="org8832876"><span class="section-number-4">5.2.2.</span> S2: 意味づけ済み・非行動（不可視）</h4>
<div class="outline-text-4" id="text-5-2-2">
<ul class="org-ul">
<li>目的:
<ul class="org-ul">
<li>未評価情報を安全に寝かせる</li>
</ul></li>
<li>可視性:
<ul class="org-ul">
<li>原則不可視</li>
<li>棚（Shelf）としての存在のみ可視</li>
</ul></li>
<li>許可される情報:
<ul class="org-ul">
<li>Topic</li>
<li>再遭遇情報</li>
<li>意図ラベルの痕跡</li>
<li>強シグナルの有無</li>
</ul></li>
<li>禁止事項:
<ul class="org-ul">
<li>内容の一覧表示</li>
<li>AI による価値解釈</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbc65e86" class="outline-4">
<h4 id="orgbc65e86"><span class="section-number-4">5.2.3.</span> S3: Focus Topic</h4>
<div class="outline-text-4" id="text-5-2-3">
<ul class="org-ul">
<li>目的:
<ul class="org-ul">
<li>判断対象として前面に出す</li>
</ul></li>
<li>可視性:
<ul class="org-ul">
<li>ユーザーに完全可視</li>
</ul></li>
<li>備考:
<ul class="org-ul">
<li>ナレッジ候補の位置づけ</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6da17fb" class="outline-4">
<h4 id="org6da17fb"><span class="section-number-4">5.2.4.</span> S4: Knowledge</h4>
<div class="outline-text-4" id="text-5-2-4">
<ul class="org-ul">
<li>目的:
<ul class="org-ul">
<li>知識として確定・再利用可能にする</li>
</ul></li>
<li>可視性:
<ul class="org-ul">
<li>常時可視</li>
</ul></li>
<li>備考:
<ul class="org-ul">
<li>判断・説明・参照の責任をここに移す</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3117f77" class="outline-4">
<h4 id="org3117f77"><span class="section-number-4">5.2.5.</span> S6: Drop</h4>
<div class="outline-text-4" id="text-5-2-5">
<ul class="org-ul">
<li>目的:
<ul class="org-ul">
<li>今後扱わないことを明示する</li>
</ul></li>
<li>可視性:
<ul class="org-ul">
<li>原則不可視</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org88e85ef" class="outline-4">
<h4 id="org88e85ef"><span class="section-number-4">5.2.6.</span> S7: Trash</h4>
<div class="outline-text-4" id="text-5-2-6">
<ul class="org-ul">
<li>目的:
<ul class="org-ul">
<li>自然忘却のための猶予領域</li>
</ul></li>
<li>可視性:
<ul class="org-ul">
<li>原則不可視</li>
</ul></li>
<li>備考:
<ul class="org-ul">
<li>一定期間後に完全削除される</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5087336" class="outline-3">
<h3 id="org5087336"><span class="section-number-3">5.3.</span> 4.3 状態遷移ルール（if 文レベル）</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-org5ef5552" class="outline-4">
<h4 id="org5ef5552"><span class="section-number-4">5.3.1.</span> S0 → S1（Capture → 未確定）</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
IF:
</p>
<ul class="org-ul">
<li>ユーザーが情報を入力した</li>
</ul>

<p>
THEN:
</p>
<ul class="org-ul">
<li>状態を S1 に設定する</li>
<li>入力時刻、入力元、一次価値判断（任意）を保存する</li>
</ul>

<p>
禁止:
</p>
<ul class="org-ul">
<li>入口での重要度評価</li>
<li>自動要約による意味付け</li>
</ul>
</div>
</div>
<div id="outline-container-org1bfb005" class="outline-4">
<h4 id="org1bfb005"><span class="section-number-4">5.3.2.</span> S1 → S2（未確定 → 意味づけ済み）</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
IF:
</p>
<ul class="org-ul">
<li>AI の非同期処理が完了した</li>
</ul>

<p>
THEN:
</p>
<ul class="org-ul">
<li>Topic 分解を行う（3〜7 個）</li>
<li>棚（Shelf）に関連付ける</li>
<li>状態を S2 に遷移させる</li>
</ul>

<p>
備考:
</p>
<ul class="org-ul">
<li>強シグナル検出はフラグ付与のみ</li>
<li>状態遷移のトリガーにはしない</li>
</ul>
</div>
</div>
<div id="outline-container-org75bcb17" class="outline-4">
<h4 id="org75bcb17"><span class="section-number-4">5.3.3.</span> S1 → S7（未確定 → Trash）</h4>
<div class="outline-text-4" id="text-5-3-3">
<p>
IF:
</p>
<ul class="org-ul">
<li>完全重複</li>
<li>文脈欠落</li>
<li>明確なスパム</li>
</ul>

<p>
THEN:
</p>
<ul class="org-ul">
<li>状態を S7 に遷移させる（猶予あり）</li>
</ul>
</div>
</div>
<div id="outline-container-org6ffd90e" class="outline-4">
<h4 id="org6ffd90e"><span class="section-number-4">5.3.4.</span> S2 → S7（意味づけ済み → Trash）</h4>
<div class="outline-text-4" id="text-5-3-4">
<p>
IF:
</p>
<ul class="org-ul">
<li>TTL を超過</li>
</ul>
<p>
AND
</p>
<ul class="org-ul">
<li>再遭遇が発生していない</li>
</ul>
<p>
AND
</p>
<ul class="org-ul">
<li>意図ラベル反射がない</li>
</ul>

<p>
THEN:
</p>
<ul class="org-ul">
<li>状態を S7 に遷移させる</li>
</ul>
</div>
</div>
<div id="outline-container-org603dd59" class="outline-4">
<h4 id="org603dd59"><span class="section-number-4">5.3.5.</span> S2 → S3（意味づけ済み → Focus Topic）</h4>
<div class="outline-text-4" id="text-5-3-5">
<p>
IF:
</p>
<ul class="org-ul">
<li>ユーザーが棚を選択し</li>
</ul>
<p>
AND
</p>
<ul class="org-ul">
<li>限定可視を開き</li>
</ul>
<p>
AND
</p>
<ul class="org-ul">
<li>「重要」「判断に使う」「説明したい」のいずれかを明示した</li>
</ul>

<p>
THEN:
</p>
<ul class="org-ul">
<li>対象 Topic を S3 に遷移させる</li>
</ul>

<p>
禁止:
</p>
<ul class="org-ul">
<li>AI 単独判断による昇格</li>
<li>想起トリガー経由の自動昇格</li>
</ul>
</div>
</div>
<div id="outline-container-org65e8598" class="outline-4">
<h4 id="org65e8598"><span class="section-number-4">5.3.6.</span> S2 → S5（意味づけ済み → Task）</h4>
<div class="outline-text-4" id="text-5-3-6">
<p>
IF:
</p>
<ul class="org-ul">
<li>強シグナル（期限／依存／不可逆／安全）が検出され</li>
</ul>
<p>
AND
</p>
<ul class="org-ul">
<li>ユーザーが明示的に承認した</li>
</ul>

<p>
THEN:
</p>
<ul class="org-ul">
<li>外部タスク管理に Task を生成する</li>
</ul>

<p>
備考:
</p>
<ul class="org-ul">
<li>検出は自動、昇格は手動</li>
</ul>
</div>
</div>
<div id="outline-container-org4dbfaef" class="outline-4">
<h4 id="org4dbfaef"><span class="section-number-4">5.3.7.</span> S3 → S4（Focus Topic → Knowledge）</h4>
<div class="outline-text-4" id="text-5-3-7">
<p>
IF:
</p>
<ul class="org-ul">
<li>再遭遇が複数回発生した</li>
</ul>
<p>
OR
</p>
<ul class="org-ul">
<li>実際の判断に使用された</li>
</ul>
<p>
OR
</p>
<ul class="org-ul">
<li>他者に説明するために言語化された</li>
</ul>

<p>
THEN:
</p>
<ul class="org-ul">
<li>状態を S4 に遷移させる</li>
</ul>

<p>
禁止:
</p>
<ul class="org-ul">
<li>時間経過のみでの自動確定</li>
</ul>
</div>
</div>
<div id="outline-container-org6f3b48d" class="outline-4">
<h4 id="org6f3b48d"><span class="section-number-4">5.3.8.</span> S3 → S6（Focus Topic → Drop）</h4>
<div class="outline-text-4" id="text-5-3-8">
<p>
IF:
</p>
<ul class="org-ul">
<li>ユーザーが今後扱わないと明示した</li>
</ul>

<p>
THEN:
</p>
<ul class="org-ul">
<li>状態を S6 に遷移させる</li>
</ul>
</div>
</div>
<div id="outline-container-orgebdfc0c" class="outline-4">
<h4 id="orgebdfc0c"><span class="section-number-4">5.3.9.</span> S4 → S6（Knowledge → Drop）</h4>
<div class="outline-text-4" id="text-5-3-9">
<p>
IF:
</p>
<ul class="org-ul">
<li>明確な陳腐化が確認され</li>
</ul>
<p>
AND
</p>
<ul class="org-ul">
<li>ユーザーが破棄を明示した</li>
</ul>

<p>
THEN:
</p>
<ul class="org-ul">
<li>状態を S6 に遷移させる</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org11ff92d" class="outline-3">
<h3 id="org11ff92d"><span class="section-number-3">5.4.</span> 4.4 重要な補足ルール</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>想起トリガーは状態を変更しない</li>
<li>TTL は価値判断ではなく自然忘却のための仕組みである</li>
<li>状態遷移は必ずユーザー意図を伴う（Trash 除く）</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgaf201c8" class="outline-2">
<h2 id="orgaf201c8"><span class="section-number-2">6.</span> 5. 可視性設計（Visibility）</h2>
<div class="outline-text-2" id="text-6">
<p>
本章では、各状態における可視性と、ユーザーが情報に「触れる」ための条件を定義する。
</p>

<p>
本システムにおいて可視性とは、
**一覧性や把握を目的とした表示ではなく、意図を起点とした限定的な観測可能性**を意味する。
</p>
</div>
<div id="outline-container-orgf85f331" class="outline-3">
<h3 id="orgf85f331"><span class="section-number-3">6.1.</span> 5.1 可視性の原則</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>常時一覧表示を行わない</li>
<li>判断を伴う表示は、必ずユーザー意図を要求する</li>
<li>内容を隠し、存在だけを示す層を持つ</li>
</ul>
</div>
</div>
<div id="outline-container-org51850f1" class="outline-3">
<h3 id="org51850f1"><span class="section-number-3">6.2.</span> 5.2 観測窓（Observation Window）</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>観測窓とは、状態 2（意味づけ済み・非行動）に対する非侵入的な可視レイヤである</li>
<li>観測窓は以下のみを表示する
<ul class="org-ul">
<li>Topic レベルの存在感（例：「最近○○系がいくつか」）</li>
<li>入力時の意図ラベルの分布</li>
<li>再遭遇の有無</li>
</ul></li>
<li>内容本文は表示しない</li>
</ul>
</div>
</div>
<div id="outline-container-org3c2abd6" class="outline-3">
<h3 id="org3c2abd6"><span class="section-number-3">6.3.</span> 5.3 限定可視（Scoped Reveal）</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>ユーザーが明示的に「この Topic を片付けたい」「この棚を見たい」と意図した場合にのみ、状態 2 の内容を限定的に可視化する</li>
<li>限定可視は常設されない</li>
<li>セッション単位で閉じる</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc2fb61f" class="outline-2">
<h2 id="orgc2fb61f"><span class="section-number-2">7.</span> 6. 想起トリガー（Recall）</h2>
<div class="outline-text-2" id="text-7">
<p>
本章では、情報を「思い出させる」ための仕組みを定義する。
</p>
</div>
