docs/spec/html/concepts.html
<div id="outline-container-org2b73fa4" class="outline-3">
<h3 id="org2b73fa4"><span class="section-number-3">7.1.</span> 6.1 想起の原則</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>想起は行動要求を伴わない</li>
<li>想起は判断を強制しない</li>
<li>想起は状態を変化させない</li>
</ul>
</div>
</div>
<div id="outline-container-orge4f31f0" class="outline-3">
<h3 id="orge4f31f0"><span class="section-number-3">7.2.</span> 6.2 想起トリガーの種類</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>Topic 再遭遇</li>
<li>Topic 意図ラベルの反射</li>
<li>弱い定期提示（例：要約的通知）</li>
</ul>
</div>
</div>
<div id="outline-container-org146f2a8" class="outline-3">
<h3 id="org146f2a8"><span class="section-number-3">7.3.</span> 6.3 想起頻度</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>デフォルトでは低頻度とする</li>
<li>頻度はユーザーが調整可能とする</li>
<li>想起ゼロも選択可能とする</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1203abd" class="outline-2">
<h2 id="org1203abd"><span class="section-number-2">8.</span> 7. AI の責務と禁止事項</h2>
<div class="outline-text-2" id="text-8">
<p>
本章では、content-stager における
AI の責務範囲を明示する。
</p>
</div>
<div id="outline-container-orgef7585e" class="outline-3">
<h3 id="orgef7585e"><span class="section-number-3">8.1.</span> 7.1 AI が行うこと</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Topic 分解（3〜7 個）</li>
<li>形式破綻チェック
<ul class="org-ul">
<li>文脈欠落</li>
<li>リンク切れ</li>
<li>完全重複</li>
</ul></li>
<li>強シグナル検出
<ul class="org-ul">
<li>期限</li>
<li>依存</li>
<li>不可逆</li>
<li>安全</li>
</ul></li>
<li>Topic 再遭遇の集約</li>
</ul>

<p>
備考:
</p>
<ul class="org-ul">
<li>強シグナル検出はフラグ付与のみであり、状態遷移のトリガーにしない。</li>
<li>期限以外（依存/不可逆/安全）は、コンテンツ単体では確定しにくく、ユーザー文脈との一致で「成立」する（詳細は `spec/signals-and-issues.org`）。</li>
</ul>
</div>
</div>
<div id="outline-container-orgc0993e6" class="outline-3">
<h3 id="orgc0993e6"><span class="section-number-3">8.2.</span> 7.2 AI が行わないこと（禁止事項）</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>重要度・価値・優先度の評価</li>
<li>ランキング・スコアリング</li>
<li>ナレッジ確定</li>
<li>自動的な状態昇格</li>
<li>おすすめ・レコメンド表現</li>
</ul>
</div>
</div>
<div id="outline-container-org8660a83" class="outline-3">
<h3 id="org8660a83"><span class="section-number-3">8.3.</span> 7.3 テスト条件（設計拘束）</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>同一入力に対し、AI の判断結果が変動しても状態遷移が発生しないこと</li>
<li>AI が単独で S3 以上に遷移させないこと</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd0d66f9" class="outline-2">
<h2 id="orgd0d66f9"><span class="section-number-2">9.</span> 8. MVP 運用フロー</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>迷ったら情報を入力する</li>
<li>入力直後の確認のみ行う</li>
<li>AI が非同期で構造化する</li>
<li>状態 2 に不可視で滞留する</li>
<li>想起トリガーで存在を思い出す</li>
<li>意図が生じた Topic のみ限定可視</li>
<li>バケツ分け（Today / Next / Hold / Drop）</li>
<li>Task / Focus Topic / 消滅に分岐</li>
</ol>
</div>
</div>
<div id="outline-container-orge94cf39" class="outline-2">
<h2 id="orge94cf39"><span class="section-number-2">10.</span> 9. 「消化」の定義</h2>
<div class="outline-text-2" id="text-10">
<p>
本システムにおいて「消化」とは、
<b><b>情報が必ずしも理解・完了されることを意味しない。</b></b>
</p>

<p>
以下のいずれかが起きた時点で、情報は消化されたとみなす。
</p>

<ul class="org-ul">
<li>Task として外部化された</li>
<li>Knowledge として確定した</li>
<li>Drop または Trash に遷移した</li>
<li>TTL 超過により自然消滅した</li>
</ul>
</div>
</div>
<div id="outline-container-org17a9356" class="outline-2">
<h2 id="org17a9356"><span class="section-number-2">11.</span> 10. データ最小要件</h2>
<div class="outline-text-2" id="text-11">
<p>
各情報単位は、以下を最低限保持する。
</p>

<ul class="org-ul">
<li>入力時刻</li>
<li>入力元</li>
<li>状態</li>
<li>Topic 配列</li>
<li>Topic 意図ラベル（任意）</li>
<li>再遭遇カウント</li>
<li>TTL</li>
</ul>
</div>
</div>
<div id="outline-container-org5d6fc1e" class="outline-2">
<h2 id="org5d6fc1e"><span class="section-number-2">12.</span> 11. ガードレール</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>ユーザーに全件一覧を見せない</li>
<li>AI に評価語を出させない</li>
<li>未処理件数を KPI にしない</li>
<li>消化率を最適化しない</li>
</ul>
</div>
</div>
<div id="outline-container-orgb693fa5" class="outline-2">
<h2 id="orgb693fa5"><span class="section-number-2">13.</span> 12. 将来拡張の差し込み口</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>評価関数の後付け（デフォルト OFF）</li>
<li>Knowledge 層の高度化</li>
<li>外部検索・再注入</li>
<li>可視性レイヤの個人最適化</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Masahiro Ishida</p>
<p class="date">Created: 2026-02-01 Sun 17:44</p>
</div>
</body>
</html>
